In [1]:
#Programmer:Vishwanjali Kadam
#college:KSE
#Class:TE-Comp
#Roll no :48-B

In [2]:
import pandas as pd

In [3]:
import numpy as nm

In [4]:
df=pd.read_csv("student.csv")

In [5]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

CUSTOM COLUMN OPERATION

In [6]:
df['marks']+0.68

0    57.45
1    60.45
2    77.56
3    70.34
4    63.96
5    50.23
6    66.02
7    69.01
8    57.43
9    79.34
Name: marks, dtype: float64

In [7]:
df['marks']=df['marks']+0.68

In [8]:
df

   roll     name class  marks  age
0     1     anil    TE  57.45   22
1     2     amit    TE  60.45   21
2     3   aniket    BE  77.56   19
3     4  ajinkya    TE  70.34   20
4     5     asha    TE  63.96   20
5     6   ayesha    BE  50.23   20
6     7     amar    BE  66.02   19
7     8    amita    BE  69.01   23
8     9     amol    TE  57.43   20
9    10    anmol    BE  79.34   21

In [9]:
df['marks']/10+1.06

0    6.805
1    7.105
2    8.816
3    8.094
4    7.456
5    6.083
6    7.662
7    7.961
8    6.803
9    8.994
Name: marks, dtype: float64

In [10]:
df['cgpa']=df['marks']/10+1.06

In [11]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.45   22  6.805
1     2     amit    TE  60.45   21  7.105
2     3   aniket    BE  77.56   19  8.816
3     4  ajinkya    TE  70.34   20  8.094
4     5     asha    TE  63.96   20  7.456
5     6   ayesha    BE  50.23   20  6.083
6     7     amar    BE  66.02   19  7.662
7     8    amita    BE  69.01   23  7.961
8     9     amol    TE  57.43   20  6.803
9    10    anmol    BE  79.34   21  8.994

In [12]:
x=['M','M','M','M','F','M','F','F','M','M']
df['gender']=x

In [13]:
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.45   22  6.805      M
1     2     amit    TE  60.45   21  7.105      M
2     3   aniket    BE  77.56   19  8.816      M
3     4  ajinkya    TE  70.34   20  8.094      M
4     5     asha    TE  63.96   20  7.456      F
5     6   ayesha    BE  50.23   20  6.083      M
6     7     amar    BE  66.02   19  7.662      F
7     8    amita    BE  69.01   23  7.961      F
8     9     amol    TE  57.43   20  6.803      M
9    10    anmol    BE  79.34   21  8.994      M

In [14]:
df.drop(['gender','cgpa'],axis=1,inplace=True)

In [15]:
df

   roll     name class  marks  age
0     1     anil    TE  57.45   22
1     2     amit    TE  60.45   21
2     3   aniket    BE  77.56   19
3     4  ajinkya    TE  70.34   20
4     5     asha    TE  63.96   20
5     6   ayesha    BE  50.23   20
6     7     amar    BE  66.02   19
7     8    amita    BE  69.01   23
8     9     amol    TE  57.43   20
9    10    anmol    BE  79.34   21

MERGE/JOIN OF DATAFRAMES

In [16]:
ndf=pd.DataFrame({
    'roll':range(1,11),
    'cgpa':df['marks']/10+1.06,
    'gender':['M','M','M','M','F','M','F','F','M','M']
})
ndf

   roll   cgpa gender
0     1  6.805      M
1     2  7.105      M
2     3  8.816      M
3     4  8.094      M
4     5  7.456      F
5     6  6.083      M
6     7  7.662      F
7     8  7.961      F
8     9  6.803      M
9    10  8.994      M

In [17]:
ndf.columns

Index(['roll', 'cgpa', 'gender'], dtype='object')

In [18]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [19]:
df.merge(ndf,on='roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.45   22  6.805      M
1     2     amit    TE  60.45   21  7.105      M
2     3   aniket    BE  77.56   19  8.816      M
3     4  ajinkya    TE  70.34   20  8.094      M
4     5     asha    TE  63.96   20  7.456      F
5     6   ayesha    BE  50.23   20  6.083      M
6     7     amar    BE  66.02   19  7.662      F
7     8    amita    BE  69.01   23  7.961      F
8     9     amol    TE  57.43   20  6.803      M
9    10    anmol    BE  79.34   21  8.994      M

APPENDING/CONCATING THE DATAFRAMES

In [20]:
df5=pd.read_csv('student5.csv')

In [21]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [22]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [23]:
df5.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [25]:
pd.concat([df,df5], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  57.45   22
1      2     amit    TE  60.45   21
2      3   aniket    BE  77.56   19
3      4  ajinkya    TE  70.34   20
4      5     asha    TE  63.96   20
5      6   ayesha    BE  50.23   20
6      7     amar    BE  66.02   19
7      8    amita    BE  69.01   23
8      9     amol    TE  57.43   20
9     10    anmol    BE  79.34   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

STRING OPERATIONS

In [26]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [27]:
df['name'].str.lower()

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [28]:
df['name'].str.title()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [29]:
df['name'].str.swapcase()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [30]:
df['name'].str.isupper()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: name, dtype: bool

In [31]:
df['name'].str.isalpha()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

In [32]:
df['name'].str.find('e')

0   -1
1   -1
2    4
3   -1
4   -1
5    2
6   -1
7   -1
8   -1
9   -1
Name: name, dtype: int64

In [33]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [34]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [35]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [36]:
df['name'].str.repeat(3)

0             anilanilanil
1             amitamitamit
2       aniketaniketaniket
3    ajinkyaajinkyaajinkya
4             ashaashaasha
5       ayeshaayeshaayesha
6             amaramaramar
7          amitaamitaamita
8             amolamolamol
9          anmolanmolanmol
Name: name, dtype: object

GROUPING FUNCTIONS

In [37]:
gr=df.groupby('class')

In [38]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [39]:
grc=df.groupby('age')

In [40]:
grc.groups

{19: [2, 6], 20: [3, 4, 5, 8], 21: [1, 9], 22: [0], 23: [7]}

In [54]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  57.45   22
1     2     amit    TE  60.45   21
3     4  ajinkya    TE  70.34   20
4     5     asha    TE  63.96   20
8     9     amol    TE  57.43   20

In [43]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  50.23   19
TE        1  ajinkya  57.43   20

In [44]:
gr['marks'].max()

class
BE    79.34
TE    70.34
Name: marks, dtype: float64

BOOLEAN FILTERING

In [45]:
df['marks']>60

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [46]:
mask=df['marks']>60

In [47]:
df[mask]

   roll     name class  marks  age
1     2     amit    TE  60.45   21
2     3   aniket    BE  77.56   19
3     4  ajinkya    TE  70.34   20
4     5     asha    TE  63.96   20
6     7     amar    BE  66.02   19
7     8    amita    BE  69.01   23
9    10    anmol    BE  79.34   21

In [48]:
df[df['marks']>60]

   roll     name class  marks  age
1     2     amit    TE  60.45   21
2     3   aniket    BE  77.56   19
3     4  ajinkya    TE  70.34   20
4     5     asha    TE  63.96   20
6     7     amar    BE  66.02   19
7     8    amita    BE  69.01   23
9    10    anmol    BE  79.34   21

In [49]:
x=df[(df['marks']>60)&(df['class']=='BE')]

In [50]:
x

   roll    name class  marks  age
2     3  aniket    BE  77.56   19
6     7    amar    BE  66.02   19
7     8   amita    BE  69.01   23
9    10   anmol    BE  79.34   21

In [51]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  57.45   22
2     3  aniket    BE  77.56   19
9    10   anmol    BE  79.34   21

EXPORT THE DATA

In [52]:
x

   roll    name class  marks  age
2     3  aniket    BE  77.56   19
6     7    amar    BE  66.02   19
7     8   amita    BE  69.01   23
9    10   anmol    BE  79.34   21

In [53]:
x.to_csv('output.csv',index=False)